{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source": {
				"Text": "+"
			},
			"Translation": {
				"Text": "+"
			},
			"Key": "675906A64F2896EC059504A755E765E5"
		},
		{
			"Source": {
				"Text": "1/15"
			},
			"Translation": {
				"Text": "1/15"
			},
			"Key": "07CE9EA847CA5C325C9BB6A40AE53EF7"
		},
		{
			"Source": {
				"Text": "A"
			},
			"Translation": {
				"Text": "A"
			},
			"Key": "F5DF16DE4023B46EEC71C38AE39D2CE1"
		},
		{
			"Source": {
				"Text": "City Sample"
			},
			"Translation": {
				"Text": "城市示例"
			},
			"Key": "D31851814D8BF684178F12A11217BDE1"
		},
		{
			"Source": {
				"Text": "Cropout"
			},
			"Translation": {
				"Text": "Cropout"
			},
			"Key": "6C48EF8B41E536611D97A292C32260AD"
		},
		{
			"Source": {
				"Text": "D"
			},
			"Translation": {
				"Text": "D"
			},
			"Key": "24F8A21743BE49C095ACC091B680B7E0"
		},
		{
			"Source": {
				"Text": "E"
			},
			"Translation": {
				"Text": "E"
			},
			"Key": "20EA51A04DE0C088ED97E19AEEF72ADC"
		},
		{
			"Source": {
				"Text": "E"
			},
			"Translation": {
				"Text": "E"
			},
			"Key": "8BC94DB44CD4068B3D6B36976D905A15"
		},
		{
			"Source": {
				"Text": "Game Animation Sample"
			},
			"Translation": {
				"Text": "游戏动画示例"
			},
			"Key": "2C35AAB14BFD422A2FE66782721E6017"
		},
		{
			"Source": {
				"Text": "Game is running.\r\nPress \"Esc\" key to return to Editor"
			},
			"Translation": {
				"Text": "游戏正在运行。\r\n按Esc键返回编辑器"
			},
			"Key": "A56088674827EC12660AE49B08345AA1"
		},
		{
			"Source": {
				"Text": "Hello"
			},
			"Translation": {
				"Text": "你好"
			},
			"Key": "69496AA644F8C038B1E426A50AD21D63"
		},
		{
			"Source": {
				"Text": "Hillside Sample"
			},
			"Translation": {
				"Text": "Hillside示例"
			},
			"Key": "470825C542257C9908E959AAAB881145"
		},
		{
			"Source": {
				"Text": "LYRA"
			},
			"Translation": {
				"Text": "LYRA"
			},
			"Key": "E73470D24A81114B04017288C8127C8B"
		},
		{
			"Source": {
				"Text": "Move"
			},
			"Translation": {
				"Text": "移动"
			},
			"Key": "734A4E634366D0DDD8EE178C31D1813A"
		},
		{
			"Source": {
				"Text": "Q"
			},
			"Translation": {
				"Text": "Q"
			},
			"Key": "59F6D0E24904B955FAD216A907F0E15B"
		},
		{
			"Source": {
				"Text": "R"
			},
			"Translation": {
				"Text": "R"
			},
			"Key": "1FA051F94C1DE87A50CC54983EC4CE9E"
		},
		{
			"Source": {
				"Text": "Rotate"
			},
			"Translation": {
				"Text": "旋转"
			},
			"Key": "F34D6DE84A97CB61F4FA30986C9D429B"
		},
		{
			"Source": {
				"Text": "S"
			},
			"Translation": {
				"Text": "S"
			},
			"Key": "81853CF44BC77A94CF0FBAABE7B778DC"
		},
		{
			"Source": {
				"Text": "Scale"
			},
			"Translation": {
				"Text": "缩放"
			},
			"Key": "8BF62AC646D7992EE2EE78A65A47F248"
		},
		{
			"Source": {
				"Text": "Stack O Bot"
			},
			"Translation": {
				"Text": "Stack O Bot"
			},
			"Key": "72B06FA94D1CA4D41EBA1FAE31D6E3D6"
		},
		{
			"Source": {
				"Text": "Title"
			},
			"Translation": {
				"Text": "标题"
			},
			"Key": "DF4A3CBC4ECF7F7D56A03CA636671154"
		},
		{
			"Source": {
				"Text": "U"
			},
			"Translation": {
				"Text": "U"
			},
			"Key": "CF9D474F4FAA26195D1635B3F62AAB7D"
		},
		{
			"Source": {
				"Text": "W"
			},
			"Translation": {
				"Text": "W"
			},
			"Key": "6E6B400D415178AA37A59E8D372AA84A"
		},
		{
			"Source": {
				"Text": "W"
			},
			"Translation": {
				"Text": "W"
			},
			"Key": "AE21E6344E4C69A77C8FF3825A199620"
		},
		{
			"Source": {
				"Text": "W"
			},
			"Translation": {
				"Text": "W"
			},
			"Key": "C6C12720470CBEAE8B18E3AE8F801BFC"
		},
		{
			"Source": {
				"Text": "Welcome to Unreal Engine 5! This level will guide you\r\n through some of the basics of the engine.\r\n\r\nHold the right mouse button and use W,A,S, D to move around the level \r\nwhile using the mouse to look.\r\nPress the green play button to start the game.\r\n"
			},
			"Translation": {
				"Text": "欢迎来到虚幻引擎5！本关卡将引导你\r\n了解引擎的一些基础知识。\r\n\r\n按住鼠标右键，使用W、A、S、D在关卡中移动\r\n，同时移动鼠标环顾四周。\r\n点击绿色的运行按钮启动游戏。\r\n"
			},
			"Key": "0E6F2F33442EF03759C01E82B49C875A"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "StrT_DevCom",
			"Children": [
				{
					"Source": {
						"Text": "                Use the W, A, S, and D keys to walk."
					},
					"Translation": {
						"Text": "使用W、A、S、D键行走。"
					},
					"Key": "NavInGame_Move"
				},
				{
					"Source": {
						"Text": "At each Station"
					},
					"Translation": {
						"Text": "在每个站点"
					},
					"Key": "StartingHelp"
				},
				{
					"Source": {
						"Text": "At each station in this tutorial, you'll learn about how to edit the\r\nworld and see how your changes affect the game experience.\r\n\r\nOn your left is a handy written companion. Follow along for \r\nhints and details on all the concepts you'll encounter!"
					},
					"Translation": {
						"Text": "在本教程的每个站点，你都将了解到如何编辑\r\n世界场景，以及你的更改会如何影响游戏体验。\r\n\r\n在你的左侧还有书面的指南，方便你参考。请跟随\r\n指引，了解你会遇到的各种概念的处理建议与细节信息！"
					},
					"Key": "TutFinder"
				},
				{
					"Source": {
						"Text": "Blueprint is a visual scripting language \r\nthat you can use to create logic and manage events,\r\nlike this switch that unlocks the door.\r\n\r\nFor a challenge: see if you can figure out how to\r\nmake the light above the door change color the\r\nsame way the other lights do."
					},
					"Translation": {
						"Text": "蓝图是一种可视化脚本语言\r\n，你可以用它来创建逻辑和管理事件，\r\n就像这个可以解锁大门的开关一样。挑战：看看你能不能想出办法\r\n，让门上的灯和其他灯一样变色。\r\n"
					},
					"Key": "Blueprint"
				},
				{
					"Source": {
						"Text": "Environment lighting and atmosphere is controlled by multiple actors: \r\n- A directional light, which simulates light coming from the sun.\r\n- A sky light, which adds base ambient light.\r\n- A sky atmosphere, which controls the ambient colour of the sky.\r\n\r\nWhile editing, you can change the sun's angle by holding\r\nCtrl+L and moving the mouse. "
					},
					"Translation": {
						"Text": "环境光照和大气由多个Actor控制：\r\n- 定向光源，模拟来自太阳的光线。\r\n- 天空光照，增添基础的环境光。\r\n- 天空大气，用于控制天空的环境色彩。\r\n\r\n编辑时，你可以按住\r\nCtrl+L并移动鼠标来改变太阳的角度。 "
					},
					"Key": "Atmos"
				},
				{
					"Source": {
						"Text": "For a more advanced demo and C++ examples check out Lyra"
					},
					"Translation": {
						"Text": "如需了解进阶演示和C++示例，请查看《Lyra》项目"
					},
					"Key": "Lyra"
				},
				{
					"Source": {
						"Text": "For beginners who want to see what a more developed game looks like. Check out Stack O Bot"
					},
					"Translation": {
						"Text": "适合想了解进阶游戏开发的初学者。查看《Stack O Bot》"
					},
					"Key": "StackOBot"
				},
				{
					"Source": {
						"Text": "For those looking for more, check out the Cropout Sample"
					},
					"Translation": {
						"Text": "如需了解更多信息，请参考《Cropout》示例项目"
					},
					"Key": "Cropout"
				},
				{
					"Source": {
						"Text": "Hold the right mouse button\r\nand use the W, A, S and D keys to fly."
					},
					"Translation": {
						"Text": "按住鼠标右键\r\n并使用W、A、S、D键来飞行。"
					},
					"Key": "NavInEditor_Move"
				},
				{
					"Source": {
						"Text": "Hold the right mouse button \r\nand move the mouse\r\nto look around."
					},
					"Translation": {
						"Text": "按住鼠标右键\r\n并移动鼠标\r\n，可以环顾四周。"
					},
					"Key": "NavInEditor_Look"
				},
				{
					"Source": {
						"Text": "Materials define how the surfaces of objects react to light.\r\nYou can change them or create your own in the Material Editor.\r\n\r\nClick this ball, find its blue material in the Details panel, and\r\ndouble-click its icon to start editing. Try changing its\r\nBase Color, Metallic, and Roughness settings."
					},
					"Translation": {
						"Text": "材质决定了对象表面会对光线做出的反应。\r\n你可以在材质编辑器中更改或创建自己的材质。\r\n\r\n单击这个球体，在细节面板中找到相应的蓝色材质，然后\r\n双击它的图标开始编辑。尝试更改\r\n基础颜色、金属感和粗糙度设置。"
					},
					"Key": "Material"
				},
				{
					"Source": {
						"Text": "Move the mouse to look around."
					},
					"Translation": {
						"Text": "移动鼠标环顾四周。"
					},
					"Key": "NavInGame_Look"
				},
				{
					"Source": {
						"Text": "Now that you're playing the game in the editor, the controls\r\nchange to ones that have been set up for the game project: "
					},
					"Translation": {
						"Text": "现在你在编辑器中游玩游戏时，控制\r\n会变成为游戏项目设置的控制： "
					},
					"Key": "HowToQuitPIE"
				},
				{
					"Source": {
						"Text": "Particle systems simulate a wide range of visual effects,\r\nfrom simple bursts of sprites like this to complex fluid simulations.\r\n\r\nYou create them using the Niagara editor.\r\n\r\nClick the center of this effect, find its Niagara system asset in the\r\nDetails panel, and double-click it to edit. Try changing settings\r\nlike Spawn Count and see how it changes the effect."
					},
					"Translation": {
						"Text": "粒子系统可以模拟各种视觉效果\r\n，从像这样简单的Sprite迸发到复杂的流体模拟都能实现。\r\n\r\n你可以使用Niagara编辑器来创建它们。\r\n\r\n单击该效果的中心点，在\r\n细节面板中找到相应的Niagara系统资产，然后双击该资产进行编辑。尝试更改生成数量\r\n等设置，看看效果有何变化。"
					},
					"Key": "Niagara"
				},
				{
					"Source": {
						"Text": "Press Esc to return to editing."
					},
					"Translation": {
						"Text": "按Esc键返回编辑模式。"
					},
					"Key": "EscapeReminder"
				},
				{
					"Source": {
						"Text": "Samples showcase engine features and show how to build\r\nfull games. You'll find them in the Launcher's Samples page.\r\n\r\nWant a simple game project to start with? Try Stack O Bot!\r\n\r\nOr feel free to just stay here for a while and continue digging\r\nin to what's in this project. Taking apart existing content is\r\nthe best way to learn how to make something Unreal!"
					},
					"Translation": {
						"Text": "这些示例展示了引擎的功能，并介绍了如何构建\r\n完整游戏。你可以在启动程序的示例页面找到它们。\r\n\r\n想先从简单的游戏项目入门吗？那就试试《Stack O Bot》吧！\r\n\r\n或者你也可以继续尝试这个项目，挖掘\r\n其中的内容。拆解现有内容是\r\n学习制作虚幻内容的最佳方法！"
					},
					"Key": "Samples"
				},
				{
					"Source": {
						"Text": "Sequencer is Unreal's timeline-based animation tool for\r\ncinematics and cutscenes. You can use it to animate objects,\r\ncameras, audio, and effects, then organize and render them\r\ninto high-quality sequences.\r\n\r\nWalk over this platform to trigger a camera flythrough\r\nmade in Sequencer."
					},
					"Translation": {
						"Text": "Sequencer是虚幻中基于时间轴的动画工具，用于\r\n制作影片和过场动画。你可以用它来制作对象的动画、\r\n摄像机、音频和特效，然后将它们组合起来，并渲染成\r\n高质量的序列。\r\n\r\n走过这个平台，就会触发在Sequencer中制作的摄像机航拍\r\n。"
					},
					"Key": "Sequencer"
				},
				{
					"Source": {
						"Text": "Templates give you starting points for building your own experiences.\r\n\r\nThey include pre-made assets, project settings, and sometimes\r\nadditional variants to customize their content.\r\n\r\nTo create a new project from a template, start the engine from the\r\nLauncher, or choose File > New Project from the editor's main menu."
					},
					"Translation": {
						"Text": "模板可以为你提供起点，让你打造属于自己的体验。\r\n\r\n其中包括预制资产、项目设置，有些还会包括\r\n额外的变体来实现定制内容。\r\n\r\n要根据模板创建新项目，可从\r\n启动程序启动引擎，或从编辑器主菜单中选择文件 > 新建项目。"
					},
					"Key": "Templates"
				},
				{
					"Source": {
						"Text": "There are three ways you can adjust an object in the 3D world: \r\nMove (W), Rotate (E), and Scale (R).\r\n\r\nClick an object, choose a tool by pressing its key or its icon in\r\nthe toolbar at the top left, then drag its colored gizmo."
					},
					"Translation": {
						"Text": "有三种方法可以调整3D世界中的对象：\r\n移动（W）、旋转（E）和缩放（R）。\r\n\r\n先单击一个对象，通过按下相应的按键或\r\n左上角工具栏中的图标，从而选择对应的工具，再拖动不同颜色的控件。"
					},
					"Key": "Transform"
				},
				{
					"Source": {
						"Text": "There are three ways you can adjust an object in the world. Select the object and then use the red, green and blue gizmo to Move, Rotate or Scale. \r\nClick the left mouse button and drag to adjust the object.\r\nObjects should only be changed while in editor. Exit using Esc Key before trying to adjust anything."
					},
					"Translation": {
						"Text": "有三种方法可以调整世界场景中的对象。先选择对象，然后使用红色、绿色和蓝色的控件来实现移动、旋转或缩放。\r\n单击鼠标左键并拖动来调整对象。\r\n只能在编辑器中更改对象。在尝试调整任何内容之前，请按Esc键退出。"
					},
					"Key": "Gizmo"
				},
				{
					"Source": {
						"Text": "There is a hidden object blocking the way across this bridge.\r\n\r\nThe Outliner on the right lists all the objects in the world.\r\nDelete the one named \"BlockingVolume\" to clear the way."
					},
					"Translation": {
						"Text": "有一个隐藏的对象挡住了过桥的路。\r\n\r\n右侧的大纲视图会列出世界场景中的所有对象。\r\n删除这个名为BlockingVolume的文件，清除挡路的障碍。"
					},
					"Key": "Outliner"
				},
				{
					"Source": {
						"Text": "This room can get dark...\r\n\r\nWhile editing, you can place a light by holding down L and\r\nclicking the left mouse button. You can also add lights from\r\nthe Place Actors panel, or the Quick Add menu in the toolbar. \r\n\r\nTry lighting up this room!"
					},
					"Translation": {
						"Text": "这个房间太昏暗了……\r\n\r\n编辑时，你可以按住L键\r\n并点击鼠标左键来放置一个光照。你也可以通过\r\n放置Actor面板或工具栏上的快速添加菜单来添加光照。\r\n\r\n把房间照亮吧！"
					},
					"Key": "Lighting"
				},
				{
					"Source": {
						"Text": "Try to walk up this ramp, and you'll sink right through! \r\nIt has no collision set up.\r\n\r\nYou can use the Details panel to change settings like this. \r\nClick the ramp, then change its Collision Presets to \"BlockAll\"."
					},
					"Translation": {
						"Text": "试着走上这个斜坡，不过你会立即掉下去！\r\n因为它还没有设置碰撞。\r\n\r\n你可以使用细节面板来更改此类设置。\r\n单击斜坡，然后将其碰撞预置更改为\"BlockAll\"（全部阻挡）。"
					},
					"Key": "DetailsPanel"
				},
				{
					"Source": {
						"Text": "Unreal offers a wide array of character animation tools. \r\nYou can create rigs, skin, and animate directly in engine,\r\nas well as create complex logic to blend animations. "
					},
					"Translation": {
						"Text": "虚幻提供了大量角色动画工具。\r\n你可以直接在引擎中创建绑定、蒙皮和动画，\r\n还可以创建复杂的逻辑来混合动画。 "
					},
					"Key": "Animation"
				},
				{
					"Source": {
						"Text": "Unreal offers realistic physics simulations, from simple\r\nrigid body interactions to detailed vehicle movement.\r\n\r\nTry pushing these objects around and see how they react!"
					},
					"Translation": {
						"Text": "虚幻会提供逼真的物理模拟，从简单的\r\n刚体交互到细节满满的载具运动。\r\n\r\n试着推动这些对象，看看它们有什么反应吧！"
					},
					"Key": "Physics"
				},
				{
					"Source": {
						"Text": "Welcome to Unreal Engine 5!\r\nLet's get started by learning to move around in the editor."
					},
					"Translation": {
						"Text": "欢迎来到虚幻引擎5！\r\n让我们开始学习如何在编辑器中移动吧。"
					},
					"Key": "Intro"
				},
				{
					"Source": {
						"Text": "When you're comfortable with this, start the game by pressing\r\nthe green Play button in the toolbar above this 3D viewport."
					},
					"Translation": {
						"Text": "调整完毕后，点击\r\n这个3D视口上方工具栏中绿色的运行按钮，开始游戏。"
					},
					"Key": "Intro2"
				},
				{
					"Source": {
						"Text": "When you're done here, click Play (or press Alt+P) and move on."
					},
					"Translation": {
						"Text": "完成后，单击运行（或按下Alt+P）继续。"
					},
					"Key": "PressPlay"
				},
				{
					"Source": {
						"Text": "When you're ready to move on, walk around this wall."
					},
					"Translation": {
						"Text": "准备好以后，你可以绕着这面墙走一圈。"
					},
					"Key": "Escape"
				},
				{
					"Source": {
						"Text": "You can add new objects to the world from the\r\nContent Drawer in the bottom left corner.\r\n\r\nThere are some sample meshes in the folder:\r\nContent / LevelPrototyping / Meshes\r\n \r\nTry dragging some in so you can get across this gap. "
					},
					"Translation": {
						"Text": "你可以从左下角的\r\n内容侧滑菜单中为世界添加新对象。\r\n\r\n我们提供的文件夹中有一些网格体示例，路径为：\r\nContent / LevelPrototyping / Meshes\r\n \r\n尝试拖入一些网格体，让你能跨越这个鸿沟。 "
					},
					"Key": "ContentDrawer"
				},
				{
					"Source": {
						"Text": "You can use MetaSounds\r\nto create and control audio in\r\nreal time with precise timing.\r\n\r\nThis fork plays a procedurally made tune.\r\nTo tweak it, select the fork and change the\r\nRandom Seed setting in the Details panel."
					},
					"Translation": {
						"Text": "你可以使用MetaSounds\r\n实时创建和控制\r\n音频，并精确控制时间。\r\n\r\n这个音叉能演奏出按程序制作的曲子。\r\n要对其进行调整，先选中音叉，然后更改细节面板中的\r\n随机种子设置。"
					},
					"Key": "Metasounds"
				}
			]
		},
		{
			"Namespace": "StrT_Titles",
			"Children": [
				{
					"Source": {
						"Text": "Animation"
					},
					"Translation": {
						"Text": "动画"
					},
					"Key": "Animation"
				},
				{
					"Source": {
						"Text": "Atmosphere"
					},
					"Translation": {
						"Text": "大气"
					},
					"Key": "Atmosphere"
				},
				{
					"Source": {
						"Text": "Blueprint"
					},
					"Translation": {
						"Text": "蓝图"
					},
					"Key": "Blueprint"
				},
				{
					"Source": {
						"Text": "Content Drawer"
					},
					"Translation": {
						"Text": "内容侧滑菜单"
					},
					"Key": "ContentDrawer"
				},
				{
					"Source": {
						"Text": "Details Panel"
					},
					"Translation": {
						"Text": "细节面板"
					},
					"Key": "DetailsPanel"
				},
				{
					"Source": {
						"Text": "Lighting"
					},
					"Translation": {
						"Text": "光照"
					},
					"Key": "lighting"
				},
				{
					"Source": {
						"Text": "Materials"
					},
					"Translation": {
						"Text": "材质"
					},
					"Key": "Materials"
				},
				{
					"Source": {
						"Text": "Metasounds"
					},
					"Translation": {
						"Text": "Metasounds"
					},
					"Key": "Metasounds"
				},
				{
					"Source": {
						"Text": "Moving Objects"
					},
					"Translation": {
						"Text": "移动对象"
					},
					"Key": "1MovingObjects"
				},
				{
					"Source": {
						"Text": "Next Steps"
					},
					"Translation": {
						"Text": "后续步骤"
					},
					"Key": "NextSteps"
				},
				{
					"Source": {
						"Text": "Outliner"
					},
					"Translation": {
						"Text": "大纲视图"
					},
					"Key": "Outliner"
				},
				{
					"Source": {
						"Text": "Particle Effects"
					},
					"Translation": {
						"Text": "粒子效果"
					},
					"Key": "Particles"
				},
				{
					"Source": {
						"Text": "Physics"
					},
					"Translation": {
						"Text": "物理"
					},
					"Key": "Physics"
				},
				{
					"Source": {
						"Text": "Samples"
					},
					"Translation": {
						"Text": "示例"
					},
					"Key": "Samples"
				},
				{
					"Source": {
						"Text": "Sequencer"
					},
					"Translation": {
						"Text": "Sequencer"
					},
					"Key": "Sequencer"
				},
				{
					"Source": {
						"Text": "Templates"
					},
					"Translation": {
						"Text": "模板"
					},
					"Key": "Templates"
				}
			]
		}
	]
}